#+TITLE: Management CLI
#+STARTUP: overview

In short, I need a way to easily manage my literate config from the command line. These will all live under =bin/=. Here is a list of those commands:
- =config-tangle= :: generates the source files

** Library
#+NAME: org-babel/load-namespaced-libraries
#+BEGIN_SRC elisp
(require 'ob-lob)
(require 'subr-x)



(defmacro ob-with-lib (library &rest body)
  `(let ((org-babel-library-of-babel ,library))
     ,@body))

(defmacro ob-with-global-lib (&rest body)
  `(ob-with-lib org-babel-library-of-babel
                ,@body))

(defmacro ob-lib-changes (&rest body)
  `(ob-with-global-lib
    (let ((previous-lib org-babel-library-of-babel))
      ,@body
      (seq-difference org-babel-library-of-babel previous-lib))))

(defun ob-namespace-lib (namespace library)
  (mapcar
   (lambda (entry)
     (let* ((old-name (symbol-name (car entry)))
            (new-name (concat namespace "/" old-name)))
       (setf (car entry) (intern new-name)
             (nth 5 entry) new-name)
       entry))
   library))

(defun ob-lib-from-file (file &optional load namespace)
  (message "namespace %s" namespace)
  (let ((library (ob-lib-changes (org-babel-lob-ingest file))))
    (when namespace
      (setq library (ob-namespace-lib namespace library)))

    (when load
      (setq org-babel-library-of-babel (append
                                        library
                                        org-babel-library-of-babel)))
    library))

(defun ob-lib-from-files (files &optional load namespace-fn)
  ;; If there are no cycles in the dependencies (fileA -needs-> fileB -needs-> fileC -needs-> fileA)
  ;; then this is enough tries to ensure we load all the files. Eventually, we could get more sophisticated
  ;; in how we load src blocks as cyclic file dependency does not imply a cyclic src block dependency.
  ;; This is good enough for now
  (let* ((max-tries (length files))
         (retry-table (make-hash-table :test #'equal
                                       :size (length files)))
         (library
          (ob-lib-changes
           (while files
             (let* ((file (pop files))
                    (try-count (or (gethash file retry-table) 0)))
               (puthash file (1+ try-count) retry-table)
               (condition-case err
                   (progn
                     (ob-lib-from-file file t (funcall (or namespace-fn #'identity) file))
                     (message "Successfully loaded library from file: %s" file))
                 (t (message "Error when loading (%s): %s" file err)
                    (if (< try-count max-tries)
                        ;; Put in back on the end and hope what it needs can be loaded
                        (setq files (append files (list file)))
                      (user-error "Unable to resolve library references for %s after %s tries" file max-tries))))))
           (message "Finished loading %s libraries" (length files)))))

    (when load
      (setq org-babel-library-of-babel
            (append library org-babel-library-of-babel)))
    library))




(defun ob-lib-for-buffer ()
  (if-let* ((babel-library (cdr (assoc "babel-library"
                                       (append org-keyword-properties
                                               org-global-properties))))
            (babel-library (car (read-from-string (concat "(" babel-library ")")))))
      (let ((library org-babel-library-of-babel)
            include-dirs)
        (while babel-library
          (let ((arg (pop babel-library)))
            (pcase arg
              (:include-dir
               (when babel-library
                 (let (stop arg)
                   (while (and babel-library (not stop))
                     (setq arg (pop babel-library))
                     (cond ((keywordp arg)
                            (setq stop t)
                            (push arg babel-library))
                           ((eq arg 'project)
                            (when-let ((dir (projectile-project-root)))
                              (push dir include-dirs)))
                           ((and (stringp arg)
                                 (directory-name-p arg))
                            (push arg include-dirs))
                           ((symbolp arg)
                            (let ((dir (if (boundp arg)
                                           (symbol-value arg)
                                         (symbol-name arg))))
                              (when (and (stringp dir)
                                         (directory-name-p dir))
                                (push dir include-dirs))))
                           (t nil)))))))

            ;; (setq library
            ;;       (append
            ;;        (apply #'append (mapcar (lambda (dir)
            ;;                                  (ob-library-from-dir dir))
            ;;                                include-dirs))
            ;;        library))
            library)))))
#+END_SRC

#+RESULTS: org-babel/load-namespaced-libraries
: ob-lib-for-buffer
: ob-library-for-current-buffer

